app/controllers/api/v1/base_controller.rb

      def current_user
        # Use this on HEADER using X-User-Id
        @current_user ||= User.find_by(id: request.headers['X-User-Id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]