app/controllers/api/v1/sleep_records_controller.rb

      def index
        # Paginate the sleep records
        sleep_records = @current_user.sleep_records
                                     .order(created_at: :desc)
                                     .page(params[:page])
                                     .per(params[:per_page] || 20) # Default to 20 per page if no `per_page` param is provided
---
SELECT "sleep_records".* FROM "sleep_records" WHERE "sleep_records"."user_id" = $1 ORDER BY "sleep_records"."created_at" DESC  [["user_id", 2]]

      def friends_sleep_records
        sleep_records = @current_user.friends_sleep_records
                                     .includes(:user) # Eager load associated user to avoid N+1
                                     .order(created_at: :desc)
                                     .page(params[:page])
                                     .per(params[:per_page] || 20) # Default 20 per page
---
SELECT "sleep_records".* FROM "sleep_records" WHERE "sleep_records"."user_id" IN ($1, $2, $3, $4, $5, $6, $7) AND (sleep_records.clock_in_time >= '2023-03-23 08:07:14.575967') ORDER BY (sleep_records.clock_out_time - sleep_records.clock_in_time) DESC  [["user_id", 1], ["user_id", 5], ["user_id", 6], ["user_id", 7], ["user_id", 8], ["user_id", 9], ["user_id", 10]]