app/controllers/api/v1/users_controller.rb

INSERT INTO "follows" ("follower_id", "followed_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 1], ["followed_user_id", 2], ["created_at", "2023-03-30 04:54:53.351917"], ["updated_at", "2023-03-30 04:54:53.351917"]]
---
      def follow
        if follow_params[:followed_user_id].to_i == @current_user.id
          return render json: { error: "You cannot follow yourself" }, status: :unprocessable_entity
        end

        @follow = @current_user.follows.build(follow_params)
        existing = @current_user.follows.find_by_followed_user_id(follow_params[:followed_user_id])

        if existing.nil? && @follow.save

DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 91]]
---
      def unfollow
        @follow = @current_user.follows.find_by_followed_user_id(follow_params[:followed_user_id])
        @follow&.destroy