app/models/user.rb

  def friends_sleep_records
    friend_ids = follows.pluck(:followed_user_id)
    sort_order = '(sleep_records.clock_out_time - sleep_records.clock_in_time) DESC'

    SleepRecord.where(user_id: friend_ids)
               .where('sleep_records.clock_in_time >= ?', 1.week.ago)
               .order(Arel.sql(sort_order))
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "sleep_records".* FROM "sleep_records" WHERE "sleep_records"."user_id" = $1 ORDER BY id desc LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def check_in(time)
    sleep_record = sleep_records.last
    # today check in exist, just update it, if the clock out time has been filled
    if sleep_record.present? && sleep_record.clock_out_time.nil?
      sleep_record.update(clock_in_time: time)
    else # create new record for today
      sleep_record = sleep_records.create(clock_in_time: time)
---
UPDATE "sleep_records" SET "clock_in_time" = $1, "duration_in_sec" = $2, "updated_at" = $3 WHERE "sleep_records"."id" = $4  [["clock_in_time", "2023-03-30 06:10:19.995777"], ["duration_in_sec", -468524], ["updated_at", "2023-03-30 06:10:20.006906"], ["id", 45]]
INSERT INTO "sleep_records" ("user_id", "clock_in_time", "clock_out_time", "duration_in_sec", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def check_out(time)
    sleep_record = sleep_records.last
    # today check in exist, just update it

    sleep_record.update(clock_out_time: time) if sleep_record.present? && sleep_record.clock_out_time.nil?
---
UPDATE "sleep_records" SET "clock_out_time" = $1, "duration_in_sec" = $2, "updated_at" = $3 WHERE "sleep_records"."id" = $4  [["clock_out_time", "2023-03-30 07:43:13.389033"], ["duration_in_sec", 88], ["updated_at", "2023-03-30 07:43:13.396161"], ["id", 100]]